<?php
header('Access-Control-Allow-Origin: *');
header('Content-type: application/json; charset=utf-8');

class quiz
{
    public $question_arr = [
        "1. Козлы",
        "2. Святые",
        "3. Канарейки",
        "4. Попугаи",
        "5. Пчелы",
        "6. Лягушки",
        "7. Оружейники",
        "8. Мешки",
      ];
    public $a1_arr = [
        "Удинезе",
        "ПСЖ",
        "Норвич",
        "Монако",
        "Райо Вальекано",
        "Лион",
        "Арсенал",
        "КПР",
      ];
    public $a2_arr = [
        "Сб Анголы",
        "Саутгемптон",
        "Вильярреал",
        "Эспаньол",
        "Сб Руанды",
        "Монпелье",
        "Нюрнберг",
        "Вест Бромвич",
      ];
    public $a3_arr = [
        "Кельн",
        "Сент-Этьен",
        "Тоттенхем",
        "Сб Уганды",
        "Боруссия Дортмунд",
        "Леванте",
        "Эйбар",
        "Ман Сити",
      ];
    public $answer_arr = [
        "Кельн",
        "Саутгемптон",
        "Норвич",
        "Эспаньол",
        "Райо Вальекано",
        "Леванте",
        "Эйбар",
        "Вест Бромвич",
      ];
    public $n_right_answer_arr = [3, 2, 1, 2, 1, 3, 3, 2];
}

$quiz1 = new quiz();
$quiz1->comment = "Hello";

echo(json_encode($quiz1));
?>